# 3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года
# относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.

month = input("введите месяц в виде целого числа от 1 до 12 >>>")

if not month.isdigit():
    print("Неверный формат месяца")
    exit()

month = int(month)

if month not in range(1, 12):
    print("значение месяца за пределами 1 - 12")
    exit()

print("решение через list")
year_list = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
print(f"Месяц {month} это {year_list[month - 1]}")
print()
print("решение через dict")
year_dict = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень", 10: "осень", 11: "осень", 12: "зима"}
print(f"Месяц {month} это {year_dict[month]}")